### Importing libs

In [1]:
from sqlalchemy import create_engine
from IPython.display import display
import pandas as pd

In [2]:
%load_ext sql

### Connecting to a PostgreSQL database

In [3]:
engine = create_engine('postgresql://ns:ns_pass@localhost/moodle')
%sql postgresql://ns:ns_pass@localhost/moodle

'Connected: ns@moodle'

### Number of tables in moodle database

In [4]:
%%sql

select count(*)
from information_schema.tables
where table_schema = 'public';

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(448,)]

### Number of records in each of the tables given in the MIT section

In [5]:
mit = ['mdl_logstore_standard_log', 'mdl_context', 'mdl_user', 'mdl_course', 'mdl_modules' , 'mdl_course_modules', 'mdl_course_modules_completion',
       'mdl_grade_items', 'mdl_grade_grades', 'mdl_grade_categories', 'mdl_grade_items_history', 'mdl_grade_grades_history', 
       'mdl_grade_categories_history', 'mdl_forum', 'mdl_forum_discussions', 'mdl_forum_posts']

# fetches and returns number of records of a given table in moodle database
def table_count(table):
    count = %sql select count(*) as {table}_count from {table}
    return count

for table in mit:
    display(table_count(table))

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(417554,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(4359,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(1052,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(15,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(26,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(290,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(4483,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(113,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(3643,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(16,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(486,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(7108,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(46,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(34,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(23,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(131,)]

### Number of quiz submissions by hour of day

In [6]:
%%sql

SELECT Extract(HOUR FROM to_timestamp(timecreated)) AS hour, count(*) 
FROM mdl_logstore_standard_log where action='submitted' AND component like '%quiz%' GROUP BY hour;

 * postgresql://ns:***@localhost/moodle
24 rows affected.

[(0.0, 26),
 (1.0, 23),
 (2.0, 30),
 (3.0, 29),
 (4.0, 7),
 (5.0, 14),
 (6.0, 10),
 (7.0, 18),
 (8.0, 17),
 (9.0, 34),
 (10.0, 46),
 (11.0, 69),
 (12.0, 95),
 (13.0, 88),
 (14.0, 104),
 (15.0, 90),
 (16.0, 80),
 (17.0, 68),
 (18.0, 68),
 (19.0, 70),
 (20.0, 57),
 (21.0, 55),
 (22.0, 46),
 (23.0, 53)]

### Monthly usage time of learners who have confirmed and are not deleted

In [7]:
%%sql

SELECT id, lastaccess - firstaccess AS usagetime,
EXTRACT(MONTH FROM to_timestamp (firstaccess)) AS Month
FROM mdl_user WHERE confirmed = 1 AND deleted = 0 LIMIT 10;

 * postgresql://ns:***@localhost/moodle
10 rows affected.

[(1, 0, 1.0),
 (20, 13189566, 2.0),
 (15, 13903766, 2.0),
 (36, 9586676, 2.0),
 (44, 10458089, 2.0),
 (8, 1830649, 1.0),
 (13, 0, 1.0),
 (98, 12944059, 2.0),
 (28, 0, 1.0),
 (12, 0, 1.0)]

### Count of log events per user

In [8]:
actions = ['loggedin', 'viewed', 'started', 'submitted', 'uploaded', 'updated', 
 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

# fetch and return count of log events of a give action per user
def event_count(action):
    count = %sql SELECT userid, COUNT(action) AS {action}_count FROM mdl_logstore_standard_log WHERE action='{action}' GROUP BY userid limit 5
    return count

for action in actions:
    display(event_count(action))

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(1, 1), (2, 169), (3, 107), (5, 54), (7, 3)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(0, 5305), (1, 2), (2, 2492), (3, 4041), (5, 694)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(2, 14), (3, 17), (5, 11), (7, 2), (8, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(2, 21), (3, 2), (5, 5), (9, 8), (16, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(2, 21), (3, 6), (5, 1), (42, 1), (44, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(0, 649), (2, 2551), (3, 1467), (5, 19), (7, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(84, 2), (246, 1), (253, 1), (266, 2), (294, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(3, 4), (5, 2), (9, 1), (25, 10), (39, 4)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(5, 2), (9, 4), (25, 6), (38, 1), (39, 1)]

 * postgresql://ns:***@localhost/moodle
0 rows affected.

[]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(2, 5)]

### Python class to pull Overall grade of learners and Number of forum posts

In [16]:
class DBHandler():
    def __init__(self):
        pass
    
    def open_local_db(self,**kwargs):
        #extract args, if they are not provided assign a default value
        user = kwargs.get('user','ns')
        password = kwargs.get('password', 'ns_pass')
        db = kwargs.get('db','moodle')
        
        # try to make a connection to PostgreSQL
        # show error message if failed to make a connection
        try:
            params = dict(user=user,
                          password=password,
                          host = "127.0.0.1",
                          #port = "5432",
                          database = db)
            proot = 'postgresql://{user}:{password}@{host}/{database}'.format(**params)
            engine = create_engine(proot)
        except (Exception, psycopg2.Error) as error :
            logger.error(f"Error while connecting to PostgreSQL {error}")
            
        return engine
    
    # fetch and return overall grade of learners
    def num_forum_posts(self):
        count = %sql select count(*) from mdl_forum_posts
        return count
    
    # fetch and return number of forum posts
    def overall_grade(self):
        overall = %sql select userid, round(SUM(finalgrade)/count(*), 2) as overall_grade from mdl_grade_grades Where finalgrade is not null group by userid limit 20
        return overall

### Open connection to postgreSQL

In [17]:
db = DBHandler()
db.open_local_db()

Engine(postgresql://ns:***@127.0.0.1/moodle)

### Fetch number of forums

In [18]:
db.num_forum_posts()

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(131,)]

### Fetch overall grade of learners
The output is limited to only 20 learners

In [20]:
db.overall_grade()

 * postgresql://ns:***@localhost/moodle
20 rows affected.

[(3, Decimal('100.00')),
 (5, Decimal('57.24')),
 (7, Decimal('100.00')),
 (9, Decimal('70.67')),
 (12, Decimal('100.00')),
 (13, Decimal('100.00')),
 (14, Decimal('100.00')),
 (15, Decimal('100.00')),
 (16, Decimal('43.73')),
 (17, Decimal('100.00')),
 (18, Decimal('100.00')),
 (19, Decimal('100.00')),
 (20, Decimal('53.00')),
 (21, Decimal('100.00')),
 (22, Decimal('100.00')),
 (23, Decimal('100.00')),
 (24, Decimal('100.00')),
 (25, Decimal('36.89')),
 (26, Decimal('100.00')),
 (27, Decimal('100.00'))]

### User Login count, Activity count, Dedication time | Top N percent

In [39]:
class UserActivity():
    def __init__(self, log_df):
        self.log_df = log_df
        self.login_c = None
        self.activity_c = None
        self.dedication_t = None
    
    # compute top n percent of a given sorted dataframe
    def top_n(self, df, percent):
        tot_len = df.shape[0]
        top = int((tot_len * percent)/100)
        return df.iloc[:top,]
    
    # return top n percent of users by login count
    def top_n_login_count(self, percent):
        self.login_c = self.login_c or self.login_count()
        return self.top_n(self.login_count(), percent)
    
    # return top n percent of user by activity count
    def top_n_activity_count(self, percent):
        self.activity_c = self.activity_c or self.activity_count() 
        return self.top_n(self.activity_c, percent)
    
    # return top n percent of user by dedication time
    def top_n_dedication_time(self, percent):
        self.dedication_t = self.dedication_t or self.dedication_time() 
        return self.top_n(self.dedication_t, percent)
    
    # returns users with corresponding login counts, sorted by login counts
    def login_count(self):
        log_df_logged_in = self.log_df[self.log_df.action == 'loggedin'][['userid', 'action']]
        login_by_user = log_df_logged_in.groupby('userid').count().sort_values('action', ascending=False)
        login_by_user.columns = ['login_count']
        return login_by_user
    
    # returns users with corresponding activity counts, sorted by activity counts
    def activity_count(self):
        activity_log = self.log_df[['userid', 'action']]
        activity_log_by_user = activity_log.groupby('userid').count().sort_values('action', ascending=False)
        activity_log_by_user.columns = ['activity_count']
        return activity_log_by_user
    
    # returns users with corresponding dedication time, sorted by dedication time
    def dedication_time(self):
        user_id =  self.log_df.userid.unique()

        d_times = {}

        for user in user_id:
            log_user = self.log_df[self.log_df.userid == user].sort_values('timecreated')

            d_time = 0 
            isLoggedIn = 0
            loggedIn_timecreated = 0

            for i in range(len(log_user)): 
                row = log_user.iloc[i,]

                row_next = log_user.iloc[i+1,] if i+1 < len(log_user) else row

                if(row.action == "loggedin"):
                    isLoggedIn = 1
                    loggedIn_timecreated = row.timecreated

                if( (i+1 == len(log_user)) | ( (row_next.action == "loggedin") & (isLoggedIn == 1) ) ):
                    d_time += row.timecreated - loggedIn_timecreated
                    isLoggedIn = 0

            d_times[user] = d_time
            
        dedication_time_df = pd.DataFrame( {'userid':list(d_times.keys()), 
                                    'dedication_time':list(d_times.values())})
        return dedication_time_df

### Fetch users' activity log from postgreSQL and compute TopN users by count of activity and engagement
UserActivity computs login count, activity count, dedication time and fetch TopN% of users by each count. You can specify any N% top get TopN% of users by each count

In [40]:
log_df = pd.read_sql("select * from mdl_logstore_standard_log", engine)
user_activity = UserActivity(log_df)

### Top 5% users by login count

In [27]:
user_activity.top_n_login_count(5)

        login_count
userid
2               169
246             113
3               107
369             100
165              91
290              73
344              68
266              64
45               63
90               57
170              55
5                54
581              51
190              50
917              47
25               46
277              46
383              42
57               41
362              40
409              38
95               37
607              37
586              36
259              36
50               33
286              33
48               32
294              31
284              30

### Top 3% users by activity count

In [28]:
user_activity.top_n_activity_count(3)

        activity_count
userid
2                45023
246              13917
3                12922
917              10696
581              10533
290               8558
347               7320
0                 7257
607               6461
344               6019
165               6015
228               5063
201               4964
42                4916
90                4644
369               4608
328               4297
45                4241
480               4232
742               4220
95                4004
266               3902
586               3857
77                3832
879               3725
786               3692
377               3459
1025              3404
567               3345
210               3075
382               2994

### Top 4% users by dedication time

In [41]:
user_activity.top_n_dedication_time(4)

    userid  dedication_time
0        0       1564600616
1        2         12327893
2        3          7796683
3        1               20
4        5          7493453
5        4       1548494441
6        7         15305320
7        8          4780234
8        9         11769703
9       20         13951261
10      25          6350711
11      16         14195176
12      32         14176223
13      15         13996865
14      47         14150570
15      56         13376686
16      42          9392651
17      74         13468902
18      65          6291730
19      64         14137734
20      73         14086658
21      19         14159397
22      44          8825343
23      61         10234433
24      40         12429405
25      -1       1564597508
26      45          6252524
27      69         14076176
28      36          8627098
29      59         13735209
30      57         11823013
31      54         14093660
32      62          5713087
33      51         12312825
34      38          8203312
35      24          5354220
36      67         13875133
37      48         12174445
38      60         13241745
39      71         12428679
40      70         14078723